#include<stdio.h>
#include<stdlib.h>
#include<locale.h>

int main (void){
 
setlocale(LC_ALL,"Portuguese");

int B;

printf ("\n1    2    4    8    16    32    64    128");
printf ("\n2    4    8    16   32    64    128   256");
printf ("\n4    8    16   32   64    128   256   512");
printf ("\n8    16   32   64   128   256   512   1024");
printf ("\n16   32   64   128  256   512   1024  2048");
printf ("\n32   64   128  256  512   1024  2048  4096");
printf ("\n64   128  256  512  1024  2048  4096  8192");
printf ("\n128  256  512  1024 2048  4096  8192  16384");
B=1+2+4+8+16+32+64+128+2+4+8+16+32+64+128+256+4+8+16+32+64+128+256+512+8+16+32+64+128+256+512+1024+16+32+64+128+256+512+1024+2048+32+64+128+256+512+1024+2048+4096+4+128+256+512+1024+2048+4096+8192+128+256+512+1024+4096+8192+16384;
printf ("\n");
printf ("\nA quantidade de grãos que o sabio deve receber é %d de grãos",B);
printf ("\n");
system ("PAUSE");
}
